<a href="https://colab.research.google.com/github/sjb3190/TIL-PLC-/blob/main/Untitled1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
df = pd.DataFrame(
    {
        'name':['김지훈', '이유진', '박동현', '김민지'],
        'english':[90, 80, 60, 70],
        'math':[50, 60, 100, 20]
    })
df

  name  english  math
0  김지훈       90    50
1  이유진       80    60
2  박동현       60   100
3  김민지       70    20

In [ ]:
print( '영어 점수 합계:', sum(df['english']) )

영어 점수 합계: 300

In [ ]:
print( '영어 점수 평균:', sum(df['english']/4) )

영어 점수 평균: 75.0

In [ ]:
df = pd.read_excel('./data/excel files/excel_exam.xlsx')
df

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [ ]:
print("영어평균:",sum(df['english'])/20)

영어평균: 84.9

In [ ]:
df = pd.read_excel('./data/excel files/excel_exam_noheader.xlsx')
df

     1  1.1  50  98  50.1
0    2    1  60  97    60
1    3    1  45  86    78
2    4    1  30  98    58
3    5    2  25  80    65
4    6    2  50  89    98
5    7    2  80  90    45
6    8    2  90  78    25
7    9    3  20  98    15
8   10    3  50  98    45
9   11    3  65  65    65
10  12    3  45  85    32
11  13    4  46  98    65
12  14    4  48  87    12
13  15    4  75  56    78
14  16    4  58  98    65
15  17    5  65  68    98
16  18    5  80  78    90
17  19    5  89  68    87
18  20    5  78  83    58

In [ ]:
df = pd.read_excel('./data/excel files/excel_exam_noheader.xlsx', header=None)
df

     0  1   2   3   4
0    1  1  50  98  50
1    2  1  60  97  60
2    3  1  45  86  78
3    4  1  30  98  58
4    5  2  25  80  65
5    6  2  50  89  98
6    7  2  80  90  45
7    8  2  90  78  25
8    9  3  20  98  15
9   10  3  50  98  45
10  11  3  65  65  65
11  12  3  45  85  32
12  13  4  46  98  65
13  14  4  48  87  12
14  15  4  75  56  78
15  16  4  58  98  65
16  17  5  65  68  98
17  18  5  80  78  90
18  19  5  89  68  87
19  20  5  78  83  58

In [ ]:
df = pd.read_csv('./data/csv files/123.csv')
df

   항목1  항목2
0   12  334
1   25  213

In [ ]:
import pandas as pd
exam = pd.read_csv('./data/csv files/exam.csv')
exam.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

In [ ]:
exam

    id  nclass  math  english  science
0    1       1    50       98       50
1    2       1    60       97       60
2    3       1    45       86       78
3    4       1    30       98       58
4    5       2    25       80       65
5    6       2    50       89       98
6    7       2    80       90       45
7    8       2    90       78       25
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32
12  13       4    46       98       65
13  14       4    48       87       12
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [ ]:
class1 = exam.query('nclass == 1 ')
class2 = exam.query('nclass == 2 ')
class3 = exam.query('nclass == 3 ')
class4 = exam.query('nclass == 4 ')
class5 = exam.query('nclass == 5 ')

print(class1['science'].mean())
print(class2['science'].mean())
print(class3['science'].mean())
print(class4['science'].mean())
print(class5['science'].mean())

61.5
58.25
39.25
55.0
83.25

In [ ]:
exam[['math']]

    math
0     50
1     60
2     45
3     30
4     25
5     50
6     80
7     90
8     20
9     50
10    65
11    45
12    46
13    48
14    75
15    58
16    65
17    80
18    89
19    78

In [ ]:
exam.query('math <= 50')\
     [['id', 'math']]\

    id  math
0    1    50
2    3    45
3    4    30
4    5    25
5    6    50
8    9    20
9   10    50
11  12    45
12  13    46
13  14    48

In [ ]:
mpg = pd.read_csv('./data/csv files/mpg.csv')
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl category
0         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
1         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
2         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
3         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
4         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [ ]:
mpg[['category', 'cty']]

    category  cty
0    compact   18
1    compact   21
2    compact   20
3    compact   21
4    compact   16
..       ...  ...
229  midsize   19
230  midsize   21
231  midsize   16
232  midsize   18
233  midsize   17

[234 rows x 2 columns]

In [ ]:
df_volkswagen = mpg.query('manufacturer == "volkswagen"')
df_volkswagen.sort_values('cty', ascending=False).head()

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category
221,volkswagen,new beetle,1.9,1999,4,manual(m5),f,35,44,d,subcompact
212,volkswagen,jetta,1.9,1999,4,manual(m5),f,33,44,d,compact
222,volkswagen,new beetle,1.9,1999,4,auto(l4),f,29,41,d,subcompact
210,volkswagen,gti,2.0,2008,4,auto(s6),f,22,29,p,compact
215,volkswagen,jetta,2.0,2008,4,auto(s6),f,22,29,p,compact

In [ ]:
exam.assign(total=exam['math'] + exam['english']+exam['science'])

    id  nclass  math  english  science  total
0    1       1    50       98       50    198
1    2       1    60       97       60    217
2    3       1    45       86       78    209
3    4       1    30       98       58    186
4    5       2    25       80       65    170
5    6       2    50       89       98    237
6    7       2    80       90       45    215
7    8       2    90       78       25    193
8    9       3    20       98       15    133
9   10       3    50       98       45    193
10  11       3    65       65       65    195
11  12       3    45       85       32    162
12  13       4    46       98       65    209
13  14       4    48       87       12    147
14  15       4    75       56       78    209
15  16       4    58       98       65    221
16  17       5    65       68       98    231
17  18       5    80       78       90    248
18  19       5    89       68       87    244
19  20       5    78       83       58    219

In [ ]:
exam.agg(mean_math = ('math', 'mean'))

            math
mean_math  57.45

In [ ]:
exam.groupby('nclass').agg(mean_math=('math', 'mean'))

        mean_math
nclass
1           46.25
2           61.25
3           45.00
4           56.75
5           78.00

In [ ]:
exam.groupby('nclass', as_index=False).agg(mean_math = ('math', 'mean'))

   nclass  mean_math
0       1      46.25
1       2      61.25
2       3      45.00
3       4      56.75
4       5      78.00

In [ ]:
mpg.query( 'category=="suv"' )

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category
18,chevrolet,c1500 suburban 2wd,5.3,2008,8,auto(l4),r,14,20,r,suv
19,chevrolet,c1500 suburban 2wd,5.3,2008,8,auto(l4),r,11,15,e,suv
20,chevrolet,c1500 suburban 2wd,5.3,2008,8,auto(l4),r,14,20,r,suv
21,chevrolet,c1500 suburban 2wd,5.7,1999,8,auto(l4),r,13,17,r,suv
22,chevrolet,c1500 suburban 2wd,6.0,2008,8,auto(l4),r,12,17,r,suv
...,...,...,...,...,...,...,...,...,...,...,...
176,toyota,4runner 4wd,3.4,1999,6,manual(m5),4,15,17,r,suv
177,toyota,4runner 4wd,4.0,2008,6,auto(l5),4,16,20,r,suv
178,toyota,4runner 4wd,4.7,2008,8,auto(l5),4,14,17,r,suv
198,toyota,land cruiser wagon 4wd,4.7,1999,8,auto(l4),4,11,15,r,suv
199,toyota,land cruiser wagon 4wd,5.7,2008,8,auto(s6),4,13,18,r,suv

In [ ]:
mpg.assign( total = lambda x:x['cty']+x['hwy'] )

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category,total
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,47
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,50
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,51
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,51
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,42
...,...,...,...,...,...,...,...,...,...,...,...,...
229,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,47
230,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,50
231,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,42
232,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,44
233,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,43

In [ ]:
mpg.query( 'category=="suv"' )\
   .assign( total = lambda x:x['cty']+x['hwy'] )\
   .groupby( 'manufacturer' )\
   .agg( mean_total = ('total', 'mean') )\
   .sort_values( 'mean_total', ascending=False )

              mean_total
manufacturer
subaru         43.833333
toyota         32.625000
nissan         31.750000
mercury        31.250000
jeep           31.125000
ford           30.666667
chevrolet      29.777778
lincoln        28.333333
land rover     28.000000
dodge          27.857143

In [ ]:
mpg.query( 'category=="suv"' )\
   .assign( total = lambda x:x['cty']+x['hwy'] )\
   .groupby( 'manufacturer' )\
   .agg( mean_total = ('total', 'mean'))\
   .sort_values( 'mean_total' )

              mean_total
manufacturer
dodge          27.857143
land rover     28.000000
lincoln        28.333333
chevrolet      29.777778
ford           30.666667
jeep           31.125000
mercury        31.250000
nissan         31.750000
toyota         32.625000
subaru         43.833333

In [ ]:
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,category
0,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
1,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
2,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
3,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
4,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
229,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
230,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
231,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
232,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
233,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [ ]:
mpg.groupby(['category'])\
   .agg(mean_cty = ('cty', 'mean'))

             mean_cty
category
2seater     15.400000
compact     20.127660
midsize     18.756098
minivan     15.818182
pickup      13.000000
subcompact  20.371429
suv         13.500000

In [ ]:
mpg.groupby(['manufacturer'])\
   .agg(mean_hwy = ('hwy', 'mean'))\
   .sort_values('mean_hwy', ascending=False)\
   .head(3)

               mean_hwy
manufacturer
honda         32.555556
volkswagen    29.222222
hyundai       26.857143

In [ ]:
mpg.groupby(['category'])\
   .agg(mean_cty = ('cty', 'mean'))\
   .sort_values('mean_cty', ascending=False)

             mean_cty
category
subcompact  20.371429
compact     20.127660
midsize     18.756098
minivan     15.818182
2seater     15.400000
suv         13.500000
pickup      13.000000

In [ ]:
mpg.query('category=="compact"')\
   .groupby(['manufacturer'])\
   .agg(n = ('category','count'))\
   .sort_values('n', ascending=False)

               n
manufacturer
audi          15
volkswagen    14
toyota        12
subaru         4
nissan         2